<template lang="pug">
.is-flex.is-justify-content-center
  .MyShogiPlayerContainer
    ShogiPlayer(
      sp_layout="is_horizontal"
      sp_controller="is_controller_on"
      sp_slider="is_slider_on"
      sp_body=`手合割：平手
先手：
後手：
手数----指手---------消費時間--
*先手番へなちょこ急戦
*対三間42銀型
*
*使用ソフトはdlshogi
   1 ２六歩(27)        ( 0:00/00:00:00)
   2 ３四歩(33)        ( 0:00/00:00:00)
   3 ２五歩(26)        ( 0:00/00:00:00)
   4 ３三角(22)        ( 0:00/00:00:00)
   5 ７六歩(77)        ( 0:00/00:00:00)
   6 ４四歩(43)        ( 0:00/00:00:00)
   7 ４八銀(39)        ( 0:00/00:00:00)
   8 ３二飛(82)        ( 0:00/00:00:00)
   9 ３六歩(37)        ( 0:00/00:00:00)
  10 ９四歩(93)        ( 0:00/00:00:00)
  11 ９六歩(97)        ( 0:00/00:00:00)
  12 ６二玉(51)        ( 0:00/00:00:00)
  13 ６八玉(59)        ( 0:00/00:00:00)
  14 ４二銀(31)        ( 0:00/00:00:00)
  15 ７八玉(68)        ( 0:00/00:00:00)
  16 ７二銀(71)        ( 0:00/00:00:00)
  17 ５八金(49)        ( 0:00/00:00:00)
  18 ７一玉(62)        ( 0:00/00:00:00)
  19 ４六歩(47)        ( 0:00/00:00:00)
  20 ５二金(41)        ( 0:00/00:00:00)
  21 ３七桂(29)        ( 0:00/00:00:00)
  22 ８二玉(71)        ( 0:00/00:00:00)
  23 ４五歩(46)        ( 0:00/00:00:00)
*テーマ図:+400
*
*この局面での振り飛車側の応手としては、45同歩か35歩が考えられる。
*結論としては、
*35歩
* →最善手順を尽くして先手+800
*45同歩
* →最善手順を尽くして先手+1000
*
*
*
*
  24 同 歩(44)        ( 0:00/00:00:00)
  25 ２四歩(25)        ( 0:00/00:00:00)
  26 同 歩(23)        ( 0:00/00:00:00)
  27 ３三角成(88)       ( 0:00/00:00:00)
  28 同 銀(42)        ( 0:00/00:00:00)
  29 ４五桂(37)        ( 0:00/00:00:00)
*ここでは22銀か44銀が考えられるが、44銀と上がらせることができれば基本的に居飛車の攻めが成功した形となる。
*※部分図で紹介してもいいか
*
  30 ２二銀(33)        ( 0:00/00:00:00)
  31 ６六角打           ( 0:00/00:00:00)
*角の打ち場所は66と88がおすすめ.。
*66は端に利かしているため駒を持った際に攻めやすい。
*88角は角がいじめられにくい。
*
*Sugar的には将来的に角がいじめられる展開は少なめな印象であるため、66角がおすすめ。
*角交換のような展開も多いためあまり気にせず好きなほうに打つとよい。
  32 ４二飛(32)        ( 0:00/00:00:00)
  33 ２四飛(28)        ( 0:00/00:00:00)
  34 ２三歩打           ( 0:00/00:00:00)
  35 ３四飛(24)        ( 0:00/00:00:00)
*ここでは28角と33歩が考えられるが、28角は長すぎるため(先手優勢にはなる)33歩の紹介だけでいいか
  36 ３三歩打           ( 0:00/00:00:00)
  37 ４四飛(34)        ( 0:00/00:00:00)
  38 同　飛(42)        ( 0:00/00:00:00)
  39 同　角(66)        ( 0:00/00:00:00)
  40 ４三飛打           ( 0:00/00:00:00)
  41 ５三角成(44)       ( 0:00/00:00:00)
*45飛は54馬で飛車桂両取りがかかる。41飛には32馬、25飛にも21馬で銀が助からず優勢となる。
  42 同　金(52)        ( 0:00/00:00:00)
  43 同　桂成(45)       ( 0:00/00:00:00)
  44 同　飛(43)        ( 0:00/00:00:00)
  45 ３二飛打           ( 0:00/00:00:00)
  46 ５二飛(53)        ( 0:00/00:00:00)
  47 ４二金打           ( 0:00/00:00:00)
*ここまでくれば飛車を逃げれば22飛成、同飛同飛成31金も45龍から42歩の垂れ歩くらいで居飛車優勢
*+800

変化：42手
  42 ４五飛(43)        ( 0:00/00:00:00)
  43 ５四馬(53)        ( 0:00/00:00:00)

変化：36手
  36 ２八角打           ( 0:00/00:00:00)
  37 ９五歩(96)        ( 0:00/00:00:00)
  38 ３三歩打           ( 0:00/00:00:00)
  39 ３五飛(34)        ( 0:00/00:00:00)
  40 ９五歩(94)        ( 0:00/00:00:00)
  41 ２四歩打           ( 0:00/00:00:00)
  42 ４六角成(28)       ( 0:00/00:00:00)
  43 ２三歩成(24)       ( 0:00/00:00:00)
  44 ３五馬(46)        ( 0:00/00:00:00)
  45 同　歩(36)        ( 0:00/00:00:00)
  46 ４五飛(42)        ( 0:00/00:00:00)
  47 ２二と(23)        ( 0:00/00:00:00)

変化：37手
  37 ２四歩打           ( 0:00/00:00:00)
  38 １九角成(28)       ( 0:00/00:00:00)
  39 ２三歩成(24)       ( 0:00/00:00:00)
  40 同　銀(22)        ( 0:00/00:00:00)
  41 ３一飛成(34)       ( 0:00/00:00:00)
  42 ４五飛(42)        ( 0:00/00:00:00)
  43 ２一龍(31)        ( 0:00/00:00:00)
  44 ３七歩打           ( 0:00/00:00:00)
  45 ４七銀(48)        ( 0:00/00:00:00)
  46 ３八歩成(37)       ( 0:00/00:00:00)
  47 ２三龍(21)        ( 0:00/00:00:00)
  48 ３七馬(19)        ( 0:00/00:00:00)
  49 ４六歩打           ( 0:00/00:00:00)
  50 ４三飛(45)        ( 0:00/00:00:00)
  51 ２一龍(23)        ( 0:00/00:00:00)
  52 ４八と(38)        ( 0:00/00:00:00)
  53 同　金(58)        ( 0:00/00:00:00)
  54 同　馬(37)        ( 0:00/00:00:00)
  55 ５八金(69)        ( 0:00/00:00:00)
  56 ４九馬(48)        ( 0:00/00:00:00)
  57 １一角成(66)       ( 0:00/00:00:00)
  58 ４六飛(43)        ( 0:00/00:00:00)
  59 ５五馬(11)        ( 0:00/00:00:00)
*+1200だが長すぎるため途中で区切りたい、ここまでいけば飛車取りと74桂でわかりやすく先手優勢
*

変化：30手
  30 ４四銀(33)        ( 0:00/00:00:00)
  31 ２四飛(28)        ( 0:00/00:00:00)
  32 ２二歩打           ( 0:00/00:00:00)
  33 ２三歩打           ( 0:00/00:00:00)
*+1600

変化：24手
  24 ３五歩(34)        ( 0:00/00:00:00)
  25 同　歩(36)        ( 0:00/00:00:00)
  26 ４五歩(44)        ( 0:00/00:00:00)
  27 ４四歩打           ( 0:00/00:00:00)
  28 ３六歩打           ( 0:00/00:00:00)
*ここでは一見すると45桂が当然の一手のように見えるが、実はそれは15角と出られると37歩成と35飛が受けづらく居飛車が悪くなる。
*
  29 ４五桂(37)        ( 0:00/00:00:00)

変化：29手
  29 ２六飛(28)        ( 0:00/00:00:00)
  30 ３七歩成(36)       ( 0:00/00:00:00)
  31 同　銀(48)        ( 0:00/00:00:00)
*この局面での先手の方針としては、36銀→45銀で振り飛車の飛車角を封殺する狙いにある。
*よって後手は最善を尽くすのであれば54歩から53銀として44の地点を払おうとするが…
  32 ５四歩(53)        ( 0:00/00:00:00)
  33 ２四歩(25)        ( 0:00/00:00:00)
*このタイミングで突き捨てるのが絶妙。
*同角が一見気になるが、43歩成以下捌き合うと居飛車優勢となる。
*
  34 同　角(33)        ( 0:00/00:00:00)
  35 ４三歩成(44)       ( 0:00/00:00:00)
  36 同　銀(42)        ( 0:00/00:00:00)
  37 ４四歩打           ( 0:00/00:00:00)
  38 ３五角(24)        ( 0:00/00:00:00)
  39 ２三飛成(26)       ( 0:00/00:00:00)
  40 ４四角(35)        ( 0:00/00:00:00)
  41 同　角(88)        ( 0:00/00:00:00)
  42 ３七飛成(32)       ( 0:00/00:00:00)
  43 １一角成(44)       ( 0:00/00:00:00)
*+700

変化：34手
  34 同　歩(23)        ( 0:00/00:00:00)
*よって同歩となるが、ここで15角の筋が消えたためあとは気にせず36銀から45銀をしていけばよい。
  35 ３六銀(37)        ( 0:00/00:00:00)
  36 ５五歩(54)        ( 0:00/00:00:00)
  37 ４五銀(36)        ( 0:00/00:00:00)
*+1000
  38 ５三銀(42)        ( 0:00/00:00:00)
  39 ３四歩(35)        ( 0:00/00:00:00)

`
      )
</template>

<script>
// Buefy
// これは全体で使うことになるので本当は index.js で読み込んだ方がよい
import Vue from "vue"
import Buefy from "buefy"
import "buefy/dist/buefy.css"
Vue.use(Buefy)

import ShogiPlayer from "shogi-player/components/ShogiPlayer.vue"

export default {
  name: "AppShogiPlayer",
  components: {
    ShogiPlayer,
  },
  props: {
    msg: String,
  },
}
</script>

<style lang="sass">
// ShogiPlayer のスタイルを読み込む
// できれば $sp_assets_dir は取りたい
// 本当は ShogiPlayer.sass からの相対パスで assets の場所が指定できればいいけどわからないので新たに設定してもらう形にしている
$sp_assets_dir: "shogi-player/assets"
@import "shogi-player/components/ShogiPlayer.sass"

// これは public/index.html で普通に読み込んだ方がいい
@import url("https://cdn.jsdelivr.net/npm/@mdi/font@5.x/css/materialdesignicons.min.css")

// このあとで +mobile などを使いたいため
@import "~bulma/sass/utilities/_all"

// ShogiPlayer は常に横100%まで広がるので外側で大きさを調整する
.MyShogiPlayerContainer
  +mobile
    width: 100%
  +tablet
    width: 70vmin

// Vue のロゴを小さくする
#app > img
  height: 64px
</style>
